Repository: NOYSI/noysi-flutter-enterprise
Catalog: ios/Runner/*.lproj/InfoPlist.strings
Languages: ar, ca_es, de, es, eu, fr, gl, ja, pt_pt, zh_hans, zh_hant

# NSAppleMusicUsageDescription
source: Enable audio library access in order to select it and upload it.
ar: قم بتمكين الوصول إلى مكتبة الصوت من أجل تحديدها وتحميلها.
ca_es: Activeu l'accés a la biblioteca d'àudio per seleccionar-lo i penjar-lo.
de: Aktivieren Sie den Zugriff auf die Audiobibliothek, um sie auszuwählen und hochzuladen.
es: Habilite el acceso a la biblioteca de audio para seleccionar y cargar archivos.
eu: Gaitu audio liburutegiko sarbidea hautatu eta kargatzeko.
fr: Activez l'accès à la bibliothèque audio afin de la sélectionner et de la télécharger.
gl: Activa o acceso á biblioteca de audio para seleccionalo e cargalo.
ja: オーディオライブラリへのアクセスを有効にして、選択してアップロードします。
pt_pt: Habilite o acesso à biblioteca de áudio para selecioná-la e carregá-la.
zh_hans: 启用音频库访问以便选择并上传。
zh_hant: 啟用音頻庫訪問以便選擇並上傳。

# NSCalendarsUsageDescription
source: Enable calendar access in order to schedule your upcoming events.
ar: قم بتمكين الوصول إلى التقويم لجدولة الأحداث القادمة الخاصة بك.
ca_es: Activeu l'accés al calendari per programar els propers esdeveniments.
de: Aktivieren Sie den Kalenderzugriff, um Ihre bevorstehenden Veranstaltungen zu planen.
es: Habilite el acceso al calendario para programar sus próximos eventos.
eu: Gaitu egutegira sarbidea datozen gertaerak antolatzeko.
fr: Activez l'accès au calendrier afin de planifier vos événements à venir.
gl: Activa o acceso ao calendario para programar os teus próximos eventos.
ja: 今後のイベントをスケジュールするには、カレンダーへのアクセスを有効にします。
pt_pt: Ative o acesso ao calendário para agendar seus próximos eventos.
zh_hans: 启用日历访问权限以安排即将举行的活动。
zh_hant: 啟用日曆訪問權限以安排即將舉行的活動。

# NSCameraUsageDescription
source: Enable camera access to take photos and videos and save the data directly in the app. The camera can also be used for update your avatar.
ar: قم بتمكين الوصول إلى الكاميرا لالتقاط الصور ومقاطع الفيديو وحفظ البيانات مباشرة في التطبيق. يمكن أيضًا استخدام الكاميرا لتحديث الصورة الرمزية الخاصة بك.
ca_es: Activeu l'accés de la càmera per fer fotos i vídeos i desar les dades directament a l'aplicació. La càmera també es pot utilitzar per actualitzar el vostre avatar.
de: Aktivieren Sie den Kamerazugriff, um Fotos und Videos aufzunehmen und die Daten direkt in der App zu speichern. Die Kamera kann auch zum Aktualisieren Ihres Avatars verwendet werden.
es: Habilite el acceso a la cámara para tomar fotos y videos y guardar los datos directamente en la aplicación. La cámara también se puede utilizar para actualizar su avatar.
eu: Gaitu kameraren sarbidea argazkiak eta bideoak ateratzeko eta datuak zuzenean aplikazioan gordetzeko. Kamera zure avatarra eguneratzeko ere erabil daiteke.
fr: Activez l'accès à la caméra pour prendre des photos et des vidéos et enregistrer les données directement dans l'application. La caméra peut également être utilisée pour mettre à jour votre avatar.
gl: Permite o acceso á cámara para facer fotos e vídeos e gardar os datos directamente na aplicación. A cámara tamén se pode usar para actualizar o teu avatar.
ja: カメラアクセスを有効にして写真やビデオを撮影し、アプリに直接データを保存します。カメラはアバターの更新にも使用できます。
pt_pt: Habilite o acesso à câmera para tirar fotos e vídeos e salvar os dados diretamente no aplicativo. A câmera também pode ser usada para atualizar seu avatar.
zh_hans: 启用相机访问权限以拍摄照片和视频并将数据直接保存在应用程序中。相机也可以用于更新您的头像。
zh_hant: 啟用相機訪問權限以拍攝照片和視頻並將數據直接保存在應用程序中。相機也可以用於更新您的頭像。

# NSContactsUsageDescription
source: Noysi needs access to your contacts.
ar: Noysi يحتاج الوصول إلى جهات الاتصال الخاصة بك.
ca_es: Noysi necessita accés als vostres contactes.
de: Noysi benötigt Zugriff auf Ihre Kontakte.
es: Noysi necesita acceso a sus contactos.
eu: Noysik zure kontaktuetarako sarbidea behar du.
fr: Noysi a besoin d'accéder à vos contacts.
gl: Noysi precisa acceso aos teus contactos.
ja: Noysiはあなたの連絡先にアクセスする必要があります。
pt_pt: Noysi precisa acessar seus contatos.
zh_hans: Noysi需要访问您的联系人。
zh_hant: Noysi需要訪問您的聯繫人。

# NSLocationAlwaysUsageDescription
source: Noysi needs access to your location.
ar: Noysi يحتاج الوصول إلى موقعك.
ca_es: Noysi necessita accés a la vostra ubicació.
de: Noysi benötigt Zugriff auf Ihren Standort.
es: Noysi necesita acceso a tu ubicación.
eu: Noysik zure kokapenera sarbidea behar du.
fr: Noysi a besoin d'accéder à votre position.
gl: Noysi precisa acceso á túa situación.
ja: Noysiはあなたの場所にアクセスする必要があります。
pt_pt: Noysi precisa acessar sua localização.
zh_hans: Noysi需要访问您的位置。
zh_hant: Noysi需要訪問您的位置。

# NSLocationWhenInUseUsageDescription
source: Noysi needs access to your location.
ar: Noysi يحتاج الوصول إلى موقعك.
ca_es: Noysi necessita accés a la vostra ubicació.
de: Noysi benötigt Zugriff auf Ihren Standort.
es: Noysi necesita acceso a tu ubicación.
eu: Noysik zure kokapenera sarbidea behar du.
fr: Noysi a besoin d'accéder à votre position.
gl: Noysi precisa acceso á túa situación.
ja: Noysiはあなたの場所にアクセスする必要があります。
pt_pt: Noysi precisa acessar sua localização.
zh_hans: Noysi需要访问您的位置。
zh_hant: Noysi需要訪問您的位置。

# NSMicrophoneUsageDescription
source: Noysi needs access to microphone in order to record audio and upload it.
ar: يحتاج Noysi إلى الوصول إلى الميكروفون لتسجيل الصوت وتحميله.
ca_es: Noysi necessita accés al micròfon per gravar àudio i penjar-lo.
de: Noysi benötigt Zugriff auf das Mikrofon, um Audio aufnehmen und hochladen zu können.
es: Noysi necesita acceso al micrófono para grabar audio y cargarlo.
eu: Noysik mikrofonorako sarbidea behar du audioa grabatu eta kargatzeko.
fr: Noysi a besoin d'accéder au microphone pour enregistrer l'audio et le télécharger.
gl: Noysi precisa acceso ao micrófono para gravar audio e subilo.
ja: Noysiは、音声を録音してアップロードするためにマイクにアクセスする必要があります。
pt_pt: Noysi precisa de acesso ao microfone para gravar áudio e fazer upload.
zh_hans: Noysi需要访问麦克风才能录制音频并上传。
zh_hant: Noysi需要訪問麥克風才能錄製音頻並上傳。

# NSMotionUsageDescription
source: Enable motion to access your phones motions.
ar: تمكين الحركة للوصول إلى حركات الهواتف الخاصة بك.
ca_es: Activa el moviment per accedir als moviments dels teus telèfons.
de: Aktivieren Sie die Bewegung, um auf die Bewegungen Ihres Telefons zuzugreifen.
es: Habilite el movimiento para acceder a los movimientos de su teléfono.
eu: Gaitu mugimendua telefonoen mugimenduetara sartzeko.
fr: Activez le mouvement pour accéder aux mouvements de votre téléphone.
gl: Activa o movemento para acceder aos movementos dos teus teléfonos.
ja: モーションを有効にして、携帯電話のモーションにアクセスします。
pt_pt: Habilite o movimento para acessar os movimentos de seus telefones.
zh_hans: 启用动作以访问手机动作。
zh_hant: 啟用動作以訪問手機動作。

# NSPhotoLibraryUsageDescription
source: Enable media library access to upload available photos and videos and save them in Noysi. This will make the documentation easier in the app.
ar: قم بتمكين الوصول إلى مكتبة الوسائط لتحميل الصور ومقاطع الفيديو المتوفرة وحفظها في Noysi. هذا سيجعل التوثيق أسهل في التطبيق.
ca_es: Activeu l'accés a la biblioteca multimèdia per penjar fotos i vídeos disponibles i desar-los a Noysi. Això facilitarà la documentació a l'aplicació.
de: Aktivieren Sie den Zugriff auf die Medienbibliothek, um verfügbare Fotos und Videos hochzuladen und in Noysi zu speichern. Dies erleichtert die Dokumentation in der App.
es: Habilite el acceso a la biblioteca de media para cargar fotos y videos disponibles y guárdelos en Noysi. Esto facilitará la documentación en la aplicación.
eu: Gaitu mediatekarako sarbidea eskuragarri dauden argazkiak eta bideoak kargatzeko eta Noysin gordetzeko. Horrek dokumentazioa aplikazioan erraztuko du.
fr: Activez l'accès à la médiathèque pour télécharger les photos et vidéos disponibles et les enregistrer dans Noysi. Cela facilitera la documentation dans l'application.
gl: Habilite o acceso á mediateca para cargar fotos e vídeos dispoñibles e gardalos en Noysi. Isto facilitará a documentación na aplicación.
ja: メディアライブラリへのアクセスを有効にして、利用可能な写真やビデオをアップロードし、Noysiに保存します。これにより、アプリでのドキュメント作成が簡単になります。
pt_pt: Habilite o acesso à biblioteca de mídia para fazer upload de fotos e vídeos disponíveis e salvá-los no Noysi. Isso tornará a documentação mais fácil no aplicativo.
zh_hans: 允许媒体库访问权限以上传可用的照片和视频并将其保存在Noysi中。这将使文档在应用程序中更容易。
zh_hant: 允許媒體庫訪問權限以上傳可用的照片和視頻並將其保存在Noysi中。這將使文檔在應用程序中更容易。

# NSSpeechRecognitionUsageDescription
source: Speech data from this app will be sent to Apple to process your requests. This will help Apple improve its speech recognition technology.
ar: سيتم إرسال بيانات الكلام من هذا التطبيق إلى Apple لمعالجة طلباتك. سيساعد ذلك Apple على تحسين تقنية التعرف على الكلام.
ca_es: Les dades de veu d’aquesta aplicació s’enviaran a Apple per processar les vostres sol·licituds. Això ajudarà Apple a millorar la seva tecnologia de reconeixement de veu.
de: Sprachdaten von dieser App werden an Apple gesendet, um Ihre Anfragen zu bearbeiten. Dies wird Apple helfen, seine Spracherkennungstechnologie zu verbessern.
es: Los datos de voz de esta aplicación se enviarán a Apple para procesar sus solicitudes. Esto ayudará a Apple a mejorar su tecnología de reconocimiento de voz.
eu: Aplikazio honetako hizkera datuak Apple-ri bidaliko zaizkizu zure eskaerak prozesatzeko. Horrek Apple-k ahotsa ezagutzeko teknologia hobetzen lagunduko dio.
fr: Les données vocales de cette application seront envoyées à Apple pour traiter vos demandes. Cela aidera Apple à améliorer sa technologie de reconnaissance vocale.
gl: Os datos de voz desta aplicación enviaranse a Apple para procesar as túas solicitudes. Isto axudará a Apple a mellorar a súa tecnoloxía de recoñecemento de voz.
ja: このアプリからの音声データは、リクエストを処理するためにAppleに送信されます。これは、Appleが音声認識技術を改善するのに役立ちます。
pt_pt: Os dados de fala deste aplicativo serão enviados à Apple para processar suas solicitações. Isso ajudará a Apple a melhorar sua tecnologia de reconhecimento de voz.
zh_hans: 该应用程序的语音数据将发送到Apple以处理您的请求。这将有助于苹果改善其语音识别技术。
zh_hant: 該應用程序的語音數據將發送到Apple以處理您的請求。這將有助於蘋果改善其語音識別技術。

# NSFaceIDUsageDescription
source: Enable Face ID to allow a login via Face ID or Fingerprint.
ar: قم بتمكين Face ID للسماح بتسجيل الدخول عبر Face ID أو Fingerprint.
ca_es: Activeu Face ID per permetre l'accés mitjançant Face ID o l'empremta digital.
de: Aktivieren Sie die Gesichts-ID, um eine Anmeldung über die Gesichts-ID oder den Fingerabdruck zu ermöglichen.
es: Habilite el reconocimiento facial para permitir un inicio de sesión a través de Reconocimiento Facial o Huella Digital.
eu: Gaitu Face IDa Face ID edo hatz markaren bidez saioa hastea baimentzeko.
fr: Activez Face ID pour permettre une connexion via Face ID ou Fingerprint.
gl: Habilite Face ID para permitir o inicio de sesión mediante Face ID ou impresión dixital.
ja: Face IDを有効にして、FaceIDまたは指紋によるログインを許可します。
pt_pt: Ative o ID de rosto para permitir um login por meio de ID de rosto ou impressão digital.
zh_hans: 启用Face ID以允许通过Face ID或指纹登录。
zh_hant: 啟用Face ID以允許通過Face ID或指紋登錄。
